IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280013x_dcsm_z2_regs.xml
<module id="DCSM_Z2_REGS" HW_revision="" description="DCSM Z2 Registers">
	<register id="Z2_LINKPOINTER" width="32" page="1" offset="0x0" internal="0" description="Zone 2 Link Pointer">
		<bitfield id="LINKPOINTER" description="Zone2 LINK Pointer" begin="13" end="0" width="14" rwaccess="R"/>
	</register>
	<register id="Z2_OTPSECLOCK" width="32" page="1" offset="0x2" internal="0" description="Zone 2 OTP Secure Lock">
		<bitfield id="JTAGLOCK" description="JTAG Lock Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PSWDLOCK" description="Zone2 Password Lock." begin="7" end="4" width="4" rwaccess="R"/>
	</register>
	<register id="Z2_LINKPOINTERERR" width="32" page="1" offset="0x6" internal="0" description="Link Pointer Error">
		<bitfield id="Z2_LINKPOINTERERR" description="Error to Resolve Z2 Link pointer from OTP loaded values" begin="13" end="0" width="14" rwaccess="R"/>
	</register>
	<register id="Z2_GPREG1" width="32" page="1" offset="0x8" internal="0" description="Zone 2 General Purpose Register-1">
		<bitfield id="GPREG1" description="General Purpose Register-1" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2_GPREG2" width="32" page="1" offset="0xa" internal="0" description="Zone 2 General Purpose Register-2">
		<bitfield id="GPREG2" description="General Purpose Register-2" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2_GPREG3" width="32" page="1" offset="0xc" internal="0" description="Zone 2 General Purpose Register-3">
		<bitfield id="GPREG3" description="General Purpose Register-3" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2_GPREG4" width="32" page="1" offset="0xe" internal="0" description="Zone 2 General Purpose Register-4">
		<bitfield id="GPREG4" description="General Purpose Register-4" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2_CSMKEY0" width="32" page="1" offset="0x10" internal="0" description="Zone 2 CSM Key 0">
		<bitfield id="Z2_CSMKEY0" description="Word0 to unlock Zone2, should match  Z2_CSMPSWD0." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z2_CSMKEY1" width="32" page="1" offset="0x12" internal="0" description="Zone 2 CSM Key 1">
		<bitfield id="Z2_CSMKEY1" description="Word1 to unlock Zone2, should match Z2_CSMPSWD1" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z2_CSMKEY2" width="32" page="1" offset="0x14" internal="0" description="Zone 2 CSM Key 2">
		<bitfield id="Z2_CSMKEY2" description="Word2 to unlock Zone2, should match Z2_CSMPSWD2" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z2_CSMKEY3" width="32" page="1" offset="0x16" internal="0" description="Zone 2 CSM Key 3">
		<bitfield id="Z2_CSMKEY3" description="Word3 to unlock Zone2, should match Z2_CSMPSWD3" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z2_CR" width="32" page="1" offset="0x18" internal="0" description="Zone 2 CSM Control Register">
		<bitfield id="ALLZERO" description="CSMPSWD All Zeros" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="ALLONE" description="CSMPSWD All Ones" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="UNSECURE" description="CSMPSWD Match CSMKEY" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="ARMED" description="CSM Passwords Read Status" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="FORCESEC" description="Force Secure" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="Z2_GRABSECT1R" width="32" page="1" offset="0x1a" internal="0" description="Zone 2 Grab Flash Status Register 1">
		<bitfield id="GRAB_SECT0" description="Grab Flash Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT1" description="Grab Flash Sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT2" description="Grab Flash Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT3" description="Grab Flash Sector 3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT4" description="Grab Flash Sector 4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT5" description="Grab Flash Sector 5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT6" description="Grab Flash Sector 6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT7" description="Grab Flash Sector 7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT8" description="Grab Flash Sector 8" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT9" description="Grab Flash Sector 9" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT10" description="Grab Flash Sector 10" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT11" description="Grab Flash Sector 11" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT12" description="Grab Flash Sector 12" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT13" description="Grab Flash Sector 13" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT14" description="Grab Flash Sector 14" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT15" description="Grab Flash Sector 15" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_GRABSECT2R" width="32" page="1" offset="0x1c" internal="0" description="Zone 2 Grab Flash Status Register 2">
		<bitfield id="GRAB_SECT16" description="Grab Flash Sector 16" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT17" description="Grab Flash Sector 17" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT18" description="Grab Flash Sector 18" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT19" description="Grab Flash Sector 19" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT20" description="Grab Flash Sector 20" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT21" description="Grab Flash Sector 21" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT22" description="Grab Flash Sector 22" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT23" description="Grab Flash Sector 23" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT24" description="Grab Flash Sector 24" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT25" description="Grab Flash Sector 25" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT26" description="Grab Flash Sector 26" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT27" description="Grab Flash Sector 27" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT28" description="Grab Flash Sector 28" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT29" description="Grab Flash Sector 29" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT30" description="Grab Flash Sector 30" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT31" description="Grab Flash Sector 31" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_GRABSECT3R" width="32" page="1" offset="0x1e" internal="0" description="Zone 2 Grab Flash Status Register 3">
		<bitfield id="GRAB_SECT39_32" description="Grab Flash Sectors 39-32" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT47_40" description="Grab Flash Sectors 47-40" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT55_48" description="Grab Flash Sectors 55-48" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT63_56" description="Grab Flash Sectors 63-56" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT71_64" description="Grab Flash Sectors 71_64" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT79_72" description="Grab Flash Sectors 79-72" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT87_80" description="Grab Flash Sectors 87-80" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT95_88" description="Grab Flash Sectors 95-88" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT103_96" description="Grab Flash Sectors 103-96" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT111_104" description="Grab Flash Sectors 111_104" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT119_112" description="Grab Flash Sectors 119-112" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT127_120" description="Grab Flash Sectors 127-120" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_GRABRAM1R" width="32" page="1" offset="0x20" internal="0" description="Zone 2 Grab RAM Status Register 1">
		<bitfield id="GRAB_RAM0" description="Grab RAM LS0 Section A" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM LS0 Section B" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM2" description="Grab RAM LS0 Section C" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM3" description="Grab RAM LS0 Section D" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM LS1 Section A" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM LS1 Section B" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM LS1 Section C" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM LS1 Section D" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_EXEONLYSECT1R" width="32" page="1" offset="0x26" internal="0" description="Zone 2 Execute Only Flash Status Register 1">
		<bitfield id="EXEONLY_SECT0" description="Execute-Only Flash Sector 0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT1" description="Execute-Only Flash Sector 1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT2" description="Execute-Only Flash Sector 2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT3" description="Execute-Only Flash Sector 3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT4" description="Execute-Only Flash Sector 4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT5" description="Execute-Only Flash Sector 5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT6" description="Execute-Only Flash Sector 6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT7" description="Execute-Only Flash Sector 7" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT8" description="Execute-Only Flash Sector 8" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT9" description="Execute-Only Flash Sector 9" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT10" description="Execute-Only Flash Sector 10" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT11" description="Execute-Only Flash Sector 11" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT12" description="Execute-Only Flash Sector 12" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT13" description="Execute-Only Flash Sector 13" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT14" description="Execute-Only Flash Sector 14" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT15" description="Execute-Only Flash Sector 15" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT16" description="Execute-Only Flash Sector 16" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT17" description="Execute-Only Flash Sector 17" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT18" description="Execute-Only Flash Sector 18" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT19" description="Execute-Only Flash Sector 19" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT20" description="Execute-Only Flash Sector 20" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT21" description="Execute-Only Flash Sector 21" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT22" description="Execute-Only Flash Sector 22" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT23" description="Execute-Only Flash Sector 23" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT24" description="Execute-Only Flash Sector 24" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT25" description="Execute-Only Flash Sector 25" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT26" description="Execute-Only Flash Sector 26" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT27" description="Execute-Only Flash Sector 27" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT28" description="Execute-Only Flash Sector 28" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT29" description="Execute-Only Flash Sector 29" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT30" description="Execute-Only Flash Sector 30" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT31" description="Execute-Only Flash Sector 31" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="Z2_EXEONLYSECT2R" width="32" page="1" offset="0x28" internal="0" description="Zone 2 Execute Only Flash Status Register 2">
		<bitfield id="EXEONLY_SECT39_32" description="Execute-Only Flash Sectors 39-32" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT47_40" description="Execute-Only Flash Sectors 47-40" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT55_48" description="Execute-Only Flash Sectors 55-48" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT63_56" description="Execute-Only Flash Sectors 63-56" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT71_64" description="Execute-Only Flash Sectors 71-64" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT79_72" description="Execute-Only Flash Sectors 79-72" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT87_80" description="Execute-Only Flash Sectors 87-80" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT95_88" description="Execute-Only Flash Sectors 95-88" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT103_96" description="Execute-Only Flash Sectors 103-96" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT111_104" description="Execute-Only Flash Sectors 111-104" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT119_112" description="Execute-Only Flash Sectors 119-112" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT127_120" description="Execute-Only Flash Sectors 127-120" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="Z2_EXEONLYRAM1R" width="32" page="1" offset="0x2a" internal="0" description="Zone 2 Execute Only RAM Status Register 1">
		<bitfield id="EXEONLY_RAM0" description="Execute-Only RAM LS0 Section A" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM1" description="Execute-Only RAM LS0 Section B" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM2" description="Execute-Only RAM LS0 Section C" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM3" description="Execute-Only RAM LS0 Section D" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM4" description="Execute-Only RAM LS1 Section A" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM5" description="Execute-Only RAM LS1 Section B" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM6" description="Execute-Only RAM LS1 Section C" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM7" description="Execute-Only RAM LS1 Section D" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
</module>
